Actually, it seems like the changes went into v1.25.1, and using the latest provider (v5.38.0 which you are supposedly using) I was able to create an OpenSearch domain with `or1.medium.search` in us-east-1 with the following sample configuration. `encrypt_at_rest` and `ebs_options` at 20 GB are both required for OR1 instances, otherwise you'll get a validation error. Please give it another try and report back on the results.

**Configuration:**
```terraform
resource "aws_opensearch_domain" "example" {
  domain_name    = "example"
  engine_version = "OpenSearch_2.11"
  encrypt_at_rest {
    enabled = true
  }
  ebs_options {
    ebs_enabled = true
    volume_size = 20
  }
  cluster_config {
    instance_type = "or1.medium.search"
  }
}
```

**Output:**
```console
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_opensearch_domain.example will be created
  + resource "aws_opensearch_domain" "example" {
      + access_policies    = (known after apply)
      + advanced_options   = (known after apply)
      + arn                = (known after apply)
      + dashboard_endpoint = (known after apply)
      + domain_id          = (known after apply)
      + domain_name        = "example"
      + endpoint           = (known after apply)
      + engine_version     = "OpenSearch_2.11"
      + id                 = (known after apply)
      + kibana_endpoint    = (known after apply)
      + tags_all           = (known after apply)

      + cluster_config {
          + dedicated_master_enabled = false
          + instance_count           = 1
          + instance_type            = "or1.medium.search"
        }

      + ebs_options {
          + ebs_enabled = true
          + iops        = (known after apply)
          + throughput  = (known after apply)
          + volume_size = 20
          + volume_type = (known after apply)
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_opensearch_domain.example: Creating...
aws_opensearch_domain.example: Still creating... [11s elapsed]
... <omitted for brevity> ...
aws_opensearch_domain.example: Still creating... [18m51s elapsed]
aws_opensearch_domain.example: Creation complete after 18m58s [id=arn:aws:es:us-east-1:<redacted>:domain/example]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
$
```